In [1]:
import pandas as pd

In [35]:
df = pd.DataFrame({"col1": [1,2,3,4,5],
              "col2": [45,3,12,56,67],
              "col3": "sudh kumar krish naik anil".split()
    
})

In [36]:
df

   col1  col2   col3
0     1    45   sudh
1     2     3  kumar
2     3    12  krish
3     4    56   naik
4     5    67   anil

In [37]:
df["col2"].max()

67

In [38]:
df["col3"]

0     sudh
1    kumar
2    krish
3     naik
4     anil
Name: col3, dtype: object

In [39]:
df.max()

col1       5
col2      67
col3    sudh
dtype: object

In [40]:
df.describe()

           col1       col2
count  5.000000   5.000000
mean   3.000000  36.600000
std    1.581139  27.862161
min    1.000000   3.000000
25%    2.000000  12.000000
50%    3.000000  45.000000
75%    4.000000  56.000000
max    5.000000  67.000000

In [41]:
df.dtypes

col1     int64
col2     int64
col3    object
dtype: object

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      object
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [43]:
ages =df['col2']

In [11]:
df['col4'] = df['col1']**2

In [12]:
df

   col1  col2   col3  col4
0     1    45   sudh     1
1     2     3  kumar     4
2     3     4  krish     9
3     4    56    one    16
4     5    67    two    25

In [13]:
df["col5"] = df["col3"].str[0]

In [14]:
df

   col1  col2   col3  col4 col5
0     1    45   sudh     1    s
1     2     3  kumar     4    k
2     3     4  krish     9    k
3     4    56    one    16    o
4     5    67    two    25    t

In [19]:
def test(a):
    return a**2

In [22]:
df['col4_4'] = df["col1"].apply(test)

if df.["col3"].str[i] == "s":
    for i=
    print('s')
else:
    print('z')
    df["col6"]

In [23]:
df

   col1  col2   col3  col4 col5  col4_4
0     1    45   sudh     1    s       1
1     2     3  kumar     4    k       4
2     3     4  krish     9    k       9
3     4    56    one    16    o      16
4     5    67    two    25    t      25

In [25]:
def test1(a):
    if a == "s":
        return "s"
    else:
        return "z"

In [26]:
df['col6'] = df['col5'].apply(test1)

In [27]:
df

   col1  col2   col3  col4 col5  col4_4 col6
0     1    45   sudh     1    s       1    s
1     2     3  kumar     4    k       4    z
2     3     4  krish     9    k       9    z
3     4    56    one    16    o      16    z
4     5    67    two    25    t      25    z

In [28]:
def test2(a):

IndentationError: expected an indented block (4162043426.py, line 1)

In [29]:
df['col7'] = df["col3"].apply(len)

In [30]:
df

   col1  col2   col3  col4 col5  col4_4 col6  col7
0     1    45   sudh     1    s       1    s     4
1     2     3  kumar     4    k       4    z     5
2     3     4  krish     9    k       9    z     5
3     4    56    one    16    o      16    z     3
4     5    67    two    25    t      25    z     3

In [33]:
import math

In [39]:
df['col8']=df['col2'].apply(math.log)

In [40]:
df

   col1  col2   col3  col4 col5  col4_4 col6  col7      col8
0     1    45   sudh     1    s       1    s     4  3.806662
1     2     3  kumar     4    k       4    z     5  1.098612
2     3     4  krish     9    k       9    z     5  1.386294
3     4    56    one    16    o      16    z     3  4.025352
4     5    67    two    25    t      25    z     3  4.204693

In [ ]:
# NumPy